# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [1]:
import pandas as pd
import sqlite3

In [2]:
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Write an Equivalent Query using a Subquery

```SQL
SELECT customerNumber,
       contactLastName,
       contactFirstName
       FROM customers
       JOIN orders 
       USING(customerNumber)
       WHERE orderDate = '2003-01-31';
```

In [8]:
cur.execute("""SELECT customerNumber, contactLastName, contactFirstName
               FROM customers
               WHERE customerNumber IN(SELECT customerNumber
                                       FROM orders
                                       WHERE orderDate = '2003-01-31');""")

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

   customerNumber contactLastName contactFirstName
0             141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [17]:
cur.execute("""SELECT productName, COUNT(orderNumber) AS number_orders, SUM(quantityOrdered) AS total_items_sold
               FROM products
               JOIN orderdetails
               USING (productCode)
               GROUP BY productName
               ORDER BY total_items_sold DESC;""")

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

                               productName  number_orders  total_items_sold
0              1992 Ferrari 360 Spider red             53              1808
1                     1937 Lincoln Berline             28              1111
2                American Airlines: MD-11S             28              1085
3  1941 Chevrolet Special Deluxe Cabriolet             28              1076
4             1930 Buick Marquette Phaeton             28              1074

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

### A quick note on the SQL  `SELECT DISTINCT` statement:

The `SELECT DISTINCT` statement is used to return only distinct values in the specified column. In other words, it removes the duplicate values in the column from the result set.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the unique values. If you apply the `DISTINCT` clause to a column that has `NULL`, the `DISTINCT` clause will keep only one NULL and eliminates the other. In other words, the DISTINCT clause treats all `NULL` “values” as the same value.

In [29]:
cur.execute("""SELECT productName, COUNT(DISTINCT customerName) AS number_people
               FROM products
               JOIN orderdetails
               USING (productCode)
               JOIN orders
               USING (orderNumber)
               JOIN customers
               USING (customerNumber)
               GROUP BY productName
               ORDER BY number_people DESC;""")

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

                   productName  number_people
0  1992 Ferrari 360 Spider red             40
1           1934 Ford V8 Coupe             27
2     1952 Alpine Renault 1300             27
3          1972 Alfa Romeo GTA             27
4             Boeing X-32A JSF             27

## Select the Employee Number, First Name, Last Name, City (of the office), and Office Code of the Employees Who Sold Products Which Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [35]:
cur.execute("""SELECT DISTINCT employeeNumber, officeCode, o.city, firstName, lastName 
               FROM employees e
               JOIN offices o
               USING (officeCode)
               JOIN customers c
               ON e.employeeNumber = c.salesRepEmployeeNumber
               join orders
               USING (customerNumber)
               JOIN orderdetails
               USING (orderNumber)
               WHERE productCode IN (SELECT productCode
                                            FROM products
                                            JOIN orderdetails
                                            USING (productCode)
                                            JOIN orders
                                            USING (orderNumber)
                                            GROUP BY productCode
                                            HAVING COUNT (DISTINCT customerNumber) < 20);""")

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

    employeeNumber  officeCode           city firstName   lastName
0             1370           4          Paris    Gerard  Hernandez
1             1501           7         London     Larry       Bott
2             1337           4          Paris      Loui     Bondur
3             1166           1  San Francisco    Leslie   Thompson
4             1286           3            NYC  Foon Yue      Tseng
5             1612           6         Sydney     Peter      Marsh
6             1611           6         Sydney      Andy     Fixter
7             1401           4          Paris    Pamela   Castillo
8             1621           5          Tokyo      Mami      Nishi
9             1323           3            NYC    George     Vanauf
10            1165           1  San Francisco    Leslie   Jennings
11            1702           4          Paris    Martin     Gerard
12            1216           2         Boston     Steve  Patterson
13            1188           2         Boston     Julie   Firrelli
14            1504           7         London     Barry      Jones

## Select the Employee Number, First Name, Last Name, and Number of Customers for Employees Whose Customers Have an Average Credit Limit of Over 15K

In [39]:
cur.execute("""SELECT employeeNumber, firstName, lastName, COUNT(customerNumber) AS number_customers, AVG(creditLimit) AS avg_credit_limit
               FROM employees e
               JOIN customers c
               ON e.employeeNumber = c.salesRepEmployeeNumber
               GROUP BY employeeNumber, firstName, lastName
               HAVING avg_credit_limit > 15000
               ORDER BY avg_credit_limit DESC;""")

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

    employeeNumber firstName   lastName  number_customers  avg_credit_limit
0             1165    Leslie   Jennings                 6     100433.333333
1             1612     Peter      Marsh                 5      92080.000000
2             1370    Gerard  Hernandez                 7      91785.714286
3             1501     Larry       Bott                 8      91187.500000
4             1337      Loui     Bondur                 6      86233.333333
5             1611      Andy     Fixter                 5      86060.000000
6             1504     Barry      Jones                 9      85511.111111
7             1621      Mami      Nishi                 5      83900.000000
8             1216     Steve  Patterson                 6      81533.333333
9             1401    Pamela   Castillo                10      81340.000000
10            1323    George     Vanauf                 8      80887.500000
11            1188     Julie   Firrelli                 6      73916.666667
12            1702    Martin     Gerard                 6      71916.666667
13            1286  Foon Yue      Tseng                 7      66614.285714
14            1166    Leslie   Thompson                 6      65266.666667

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!